# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [34]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [35]:
serie1 = np.random.randint(1,4,100)
serie2 = np.random.randint(1,3,100)
serie3 = np.random.randint(10000,30000,100)

s1 = pd.Series(serie1,name="S1")
s2 = pd.Series(serie2,name="S2")
s3 = pd.Series(serie3,name="S3")


print(s1)
print(s2)
print(s3)

0     1
1     1
2     3
3     2
4     2
     ..
95    2
96    1
97    2
98    1
99    1
Name: S1, Length: 100, dtype: int64
0     2
1     2
2     2
3     2
4     1
     ..
95    1
96    2
97    2
98    2
99    2
Name: S2, Length: 100, dtype: int64
0     19550
1     16282
2     11662
3     23035
4     20041
      ...
95    19244
96    20900
97    19445
98    11745
99    19663
Name: S3, Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [36]:
df1 = pd.concat([s1,s2,s3],axis=1)
df1

    S1  S2     S3
0    1   2  19550
1    1   2  16282
2    3   2  11662
3    2   2  23035
4    2   1  20041
..  ..  ..    ...
95   2   1  19244
96   1   2  20900
97   2   2  19445
98   1   2  11745
99   1   2  19663

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [37]:
df1 = df1.rename(columns={"S1":"bedrs","S2":"bathrs","S3":"price_sqr_meter"})
df1

    bedrs  bathrs  price_sqr_meter
0       1       2            19550
1       1       2            16282
2       3       2            11662
3       2       2            23035
4       2       1            20041
..    ...     ...              ...
95      2       1            19244
96      1       2            20900
97      2       2            19445
98      1       2            11745
99      1       2            19663

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [38]:
s4 = pd.concat([s1,s2,s3])
df2 = pd.DataFrame(data=s4,columns=["bigcolumn"])
df2

    bigcolumn
0           1
1           1
2           3
3           2
4           2
..        ...
95      19244
96      20900
97      19445
98      11745
99      19663

[300 rows x 1 columns]

In [39]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 300 entries, 0 to 99
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   bigcolumn  300 non-null    int64
dtypes: int64(1)
memory usage: 4.7 KB

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [40]:
#Yes

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [44]:
df2.reset_index(drop=True,inplace=True)

df2

     bigcolumn
0            1
1            1
2            3
3            2
4            2
..         ...
295      19244
296      20900
297      19445
298      11745
299      19663

[300 rows x 1 columns]